---
title: Top Tracks of the Week
pubDate: {{date}}
tracks: {{tracks}}
---

## Professional

Outside of my role at Series Eight, I've spent the last year or so rebuilding this site in AstroJS, coming over from 11ty. No specific reason for it other than wanting to try something new. I enjoyed everything about 11ty, but got itchy looking at it sometimes and wanted to rebuild from scratch. I think it's paid off, at the very least I've learnt a lot about Astro in the process. I've been learning as well about developer advocacy/relations, and think that's a really interesting space to be in.


## Hobbies

In 2025, I [read more](/reading-list) books than I think I've ever read before, with my favorite series coming out of the year being "Dungeon Crawler Carl" by Matt Dinimann. Flew through the first 5 books, and with an 8th book coming out in May, I'm sure I'll be ready for it on release day. I managed to set a goal for 2026 of 18 books, which a few years ago I'd have thought was unobtainable.

I aimed to get on my longboard and surf skateboard more often this year, but it didn't really happen. I'm still working on it, but I'm also aware that my kids and career need the use of my arms, so my balance is still a work in progress! For the first part of the year, I hit the gym hard and got some personal records met which was awesome. The second half of the year was met with a few illnesses that kept me out of it, as well as a late-autumn/early winter burnout that kept me from being motivated in most things.

## Writing

I've been working on a few different posts as my redesign has been ticking over, so I've been sat with a backlog of half finished posts. Reframing this site as a digital garden has helped me to just 'get them out there' rather than having them sit in a draft folder. I've felt more motivated and focused to write more regularly, and I'm excited to see where this takes me.

## Top Tracks

Here's a few of my favorite tracks from the last month:

import TracksList from '../../components/TracksList.astro';

<TracksList tracks={frontmatter.tracks} />
